Autodesk.Revit.DB.LocationCurve.JoinType(System.Int32)
Get/change the type of the join at the specified end.
end: The end of the location curve driver under question.
Remarks: This property allows to get join type of wall and concrete beam and to set wall's join type.
The new join type is expected to be different from the current one for this end.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element is neither a wall nor a concrete beam when it tries to get the property.
The element is not a wall when it tries to set the property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A failure occurred while attempting to set the new type.

Autodesk.Revit.DB.LocationCurve.set_ElementsAtJoin(System.Int32,Autodesk.Revit.DB.ElementArray)
Change the order of elements participating in an end join with this location curve's end
end: The end at which we want to change the order of join participants
elements: An ordered list of elements
Returns: No return value
Remarks: The list of elements is expected to be a permutation of the elements already in the join at the end.
It is expected that no new elements will be introduced, and existing ones will not be removed.

Autodesk.Revit.DB.LocationCurve.get_ElementsAtJoin(System.Int32)
Get all elements joining to the end of this element's location curve
end: The end at which the join is to be obtained
Returns: An ordered list of element

Autodesk.Revit.DB.LocationCurve.ElementsAtJoin(System.Int32)
Get all elements joining to the end of this element's location curve or change the order of elements participation in the end join with this location curve's end.
end: The end at which the join occurs.
Remarks: The list of elements is expected to be a permutation of the elements already in the join at the end.
It is expected that no new elements will be introduced, and existing ones will not be removed.

Autodesk.Revit.DB.LocationCurve.Curve
Provides the ability to get and set the curve of a curve based element.
Remarks: This property can be used to set the location of curve based element to any desired
position. Many elements are curve based. Some examples are walls, beams and braces.

Autodesk.Revit.DB.LocationCurve
Provides location functionality for all elements that are based upon a curve.
Remarks: The location line objects adds additional functionality to its base location object
class. This includes reading and writing the curve contained within the element.